# control Flow แบ่งเป็น 2 กลุ่ม  / control statement แยกเป็น 2 กลุ่มเช่นกัน
# 1. Selection/Decision เลือกทำ คือ ต้องพิสูจน์ตรวจสอบก่อนทำงานใดๆ แยกเป็น 3 แบบย่อย
#  - พิสูจน์ตรวจสอบครั้งเดียว จริงทำ เท็จไม่ทำ (if)
#  - พิสูจน์ตรวจสอบครั้งเดียว จริงทำ เท็จทำ (if else)
#  - พิสูจน์ตรวจสอบหลายครั้ง            (if-elif-else)

# 2. Loop/Iteration/Repeat ทำซ้ำ คือ ทำงานเดิมๆ ซ้ำ แยกเป็น 2 แบบ
#  - รู้จำนวนครั้งในการทำซ้ำ
#  - ไม่รู้จำนวนครั้งในการทำซ้ำ
# - While, for
# ***สิ่งที่ต้องระวังในการทำซ้ำ คือ ต้้องรู้จบ 

# *** Statement ที่เกี่ยวกับ control flow คือคำสั่ง break, continue โดยเฉพาะใน loop
