# สร้างโปรแกรมคำนวณผลคูณของตัวเลข 2 จำนวนที่รับทางแป้นพิมพ์ แล้วแสดงผลทางหน้าจอ
#  ทั้งนี้โปรแกรมจะทำการคำนวณผลคูณจากตัวเลขที่รับทางแป้นพิมพ์ไปเรื่อยๆ จนกว่าผลคูณจะมากกว่า 5000 ถึงจะหยุดการทำงาน

print('โปรแกรมคำนวณผลคูณของตัวเลข 2 จำนวน')
result = 0
while result <= 5000 :
    num1 = int(input('ป้อนตัวเลขที่ 1 : '))
    num2 = int(input('ป้อนตัวเลขที่ 2 : '))
    result = num1 * num2
    print(f'ผลคูณของ {num1} และ {num2} เท่ากับ {result}')
    if result > 5000 :
        print('ผลคูณมากกว่า 5000 แล้ว ขอบคุณที่ใช้บริการ')
        break
    print('ผลคูณยังไม่เกิน 5000 กรุณาป้อนตัวเลขใหม่')
print('ขอบคุณที่ใช้บริการ')