# โปรแกรมตรวจสอบข้อมูลสายรถเมล์ โดยที่
# หากผู้ใช้ป้อนสายรถเมล์ 57 แสดงข้อความ สาย  57 ไปปิ่นเกล้า บางขุนนนท์
# หากผู้ใช้ป้อนสายรถเมล์ 3 แสดงข้อความ สาย  3 ไปสนามหลวง ลาดพร้าว
# 	หากผู้ใช้ป้อนสายรถเมล์ 71 แสดงข้อความ สาย  71ไปหัวลำโพง เยาวราช
# 	หากผู้ใช้ป้อนสายรถเมล์ 56 แสดงข้อความ สาย 56 ไปบางลำพู สะพานกรุงธน
# 	หากผูใช้ป้อนสายรถเมล์ 539 แสดงข้อความ สาย  539 ไปอนุสวรีย์ชัย สามเสน
# 	หากผู้ใช้ป้อนสายรถเมล์สายอื่นนอกจากนี้ แสดงข้อความ ยังไม่มีข้อมูลสายรถเมล์ที่สอบถาม

print('.............................')
print('โปรแกรมตรวจสอบข้อมูลสายรถเมล์')
print('.............................')
train_no = int(input('ป้อนสายรถเมล์ : '))
if train_no == 57:
    print('สาย 57 ไปปิ่นเกล้า บางขุนนนท์')
elif train_no == 3:
    print('สาย 3 ไปสนามหลวง ลาดพร้าว')
elif train_no == 71:
    print('สาย 71ไปหัวลำโพง เยาวราช')
elif train_no == 56:
    print('สาย 56 ไปบางลำพู สะพานกรุงธน')
elif train_no == 539:
    print('สาย 539 ไปอนุสวรีย์ชัย สามเสน')
else:
    print('ยังไม่มีข้อมูลสายรถเมล์ที่สอบถาม')