# สร้างโปรแกรมรับข้อมูลจำนวนเต็ม 5 จำนวนจากผู้ใช้
# และคำนวณหาผลรวม และค่าเฉลี่ยของข้อมูลที่รับเข้ามา
# เป็นเท่าใด แล้วแสดงผลทางหน้าจอ
# สูตร  
# ผลรวม = เลขตัวที่1 + เลขตัวที่2 + เลขตัวที่3 + เลขตัวที่4 + เลขตัวที่5
# ค่าเฉลี่ย = ผลรวมของเลข 5 จำนวน / 5
 
# ============================
# Program  Average  5  Number
# ============================
# Enter number 1 : <input>
# Enter number 2 : <input>
# Enter number 3 : <input>
# Enter number 4 : <input>
# Enter number 5 : <input>
# ============================
# Sum of 5 number is : <output>
# Average of 5 number is : <output>
# ============================
# Sum of 5 number is : <output>
# Average of 5 number is : <output>
# ============================
# Sum of 5 number is : <output>
# Average of 5 number is : <output>
# ============================
# Sum of 5 number is : <output>
# Average of 5 number is : <output>
# ============================
print("สร้างโปรแกรมรับข้อมูลจำนวนเต็ม 5 จำนวนจากผู้ใช้")
print("และคำนวณหาผลรวม และค่าเฉลี่ยของข้อมูลที่รับเข้ามา")
print("เป็นเท่าใด แล้วแสดงผลทางหน้าจอ")
print("สูตร")
print("ผลรวม = เลขตัวที่1 + เลขตัวที่2 + เลขตัวที่3 + เลขตัวที่4 + เลขตัวที่5")
print("ค่าเฉลี่ย = ผลรวมของเลข 5 จำนวน / 5")
print("=====================================")
print("Program  Average  5  Number")
print("=====================================")
num1 = int(input("ป้อนเลขตัวที่ 1 : "))
num2 = int(input("ป้อนเลขตัวที่ 2 : "))
num3 = int(input("ป้อนเลขตัวที่ 3 : "))
num4 = int(input("ป้อนเลขตัวที่ 4 : "))
num5 = int(input("ป้อนเลขตัวที่ 5 : "))
print("=====================================")
print(f"ผลรวมของ 5 จำนวน {num1} + {num2} + {num3} + {num4} + {num5} = {num1 + num2 + num3 + num4 + num5}")
print(f"ค่าเฉลี่ยของ 5 จำนวน {num1} + {num2} + {num3} + {num4} + {num5} = {(num1 + num2 + num3 + num4 + num5) / 5}")
print("=====================================")  

