# กรณี 1 print( ) มีข้อมูลหลายประเภททำไง???? มี 4 วิธี
# วิธีที่ 1 ใฃ้ , (โดยการแสดงผลตรงจุดที่ , จะเป็นการเว้น 1 space)
print("hello",555,"wow",999,True,"hi",10 + 20 - 5,152.875)

# วิธีที่ 2 ใฃ้ + (ข้อมูลไหนที่ไม่ใฃ้ string ต้องทำให้เป็น string ใฃ้ฟังก์ชัน str())
# ไม่มีเว้น 1 space เหมือน ,
print('hello' +str(555)+'wow'+ str(999)+str(True)+'hi'+str(10 + 20 - 5)+str(152.875))
print('hello ' +str(555)+' wow '+ str(999)+str(True)+' hi '+str(10 + 20 - 5)+str(152.875))

# วิธีที่ 3 ใช้เมธอด format()  โดยข้อมูลที่แสดงอยู่ในรูปแบบของ string
# (ข้อมูลที่ไม่ใฃ่ string ให้ใส่ใน() ของ format และตำแหน่งที่แสดงข้อมูลนั่นไม่ใส่{} แทน)
print('helllo {} wow {} {} hi {} {} ' .format(555,999,True,10+20-5,152.875))

# index number         0  1  2  3   4    5
Print('{4} {2}'.format('a','b','c','d','e'))

# วิธีท่ี่ 4 ใฃ้ F-string โดยข้อมูลที่แสดงอยู่ในรูหปแบบของ string โดยมี f อยู่ข้างหน้า
# (ข้อมูลที่ไม่ใช่ string ให้เขียนใส่ใน {} ณ ตำแหน่งนั้นๆ เลย)
print(f'hello {555} wow {999} {True} hi {10+20-5} {152.875} ')